MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA110/mcu.h
#define _AD1PCFG_PCFGL3_POSITION                 0x00000003
#define _AD1PCFG_PCFGL3_MASK                     0x00000008
#define _AD1PCFG_PCFGL3_LENGTH                   0x00000001

#define _AD1PCFG_PCFGL4_POSITION                 0x00000004
#define _AD1PCFG_PCFGL4_MASK                     0x00000010
#define _AD1PCFG_PCFGL4_LENGTH                   0x00000001

#define _AD1PCFG_PCFGL5_POSITION                 0x00000005
#define _AD1PCFG_PCFGL5_MASK                     0x00000020
#define _AD1PCFG_PCFGL5_LENGTH                   0x00000001

#define _AD1PCFG_PCFGL6_POSITION                 0x00000006
#define _AD1PCFG_PCFGL6_MASK                     0x00000040
#define _AD1PCFG_PCFGL6_LENGTH                   0x00000001

#define _AD1PCFG_PCFGL7_POSITION                 0x00000007
#define _AD1PCFG_PCFGL7_MASK                     0x00000080
#define _AD1PCFG_PCFGL7_LENGTH                   0x00000001

#define _AD1PCFG_PCFGL8_POSITION                 0x00000008
#define _AD1PCFG_PCFGL8_MASK                     0x00000100
#define _AD1PCFG_PCFGL8_LENGTH                   0x00000001

#define _AD1PCFG_PCFGL9_POSITION                 0x00000009
#define _AD1PCFG_PCFGL9_MASK                     0x00000200
#define _AD1PCFG_PCFGL9_LENGTH                   0x00000001

#define _AD1PCFG_PCFGL10_POSITION                0x0000000A
#define _AD1PCFG_PCFGL10_MASK                    0x00000400
#define _AD1PCFG_PCFGL10_LENGTH                  0x00000001

#define _AD1PCFG_PCFGL11_POSITION                0x0000000B
#define _AD1PCFG_PCFGL11_MASK                    0x00000800
#define _AD1PCFG_PCFGL11_LENGTH                  0x00000001

#define _AD1PCFG_PCFGL12_POSITION                0x0000000C
#define _AD1PCFG_PCFGL12_MASK                    0x00001000
#define _AD1PCFG_PCFGL12_LENGTH                  0x00000001

#define _AD1PCFG_PCFGL13_POSITION                0x0000000D
#define _AD1PCFG_PCFGL13_MASK                    0x00002000
#define _AD1PCFG_PCFGL13_LENGTH                  0x00000001

#define _AD1PCFG_PCFGL14_POSITION                0x0000000E
#define _AD1PCFG_PCFGL14_MASK                    0x00004000
#define _AD1PCFG_PCFGL14_LENGTH                  0x00000001

#define _AD1PCFG_PCFGL15_POSITION                0x0000000F
#define _AD1PCFG_PCFGL15_MASK                    0x00008000
#define _AD1PCFG_PCFGL15_LENGTH                  0x00000001

#define _AD1PCFGL_PCFGL0_POSITION                0x00000000
#define _AD1PCFGL_PCFGL0_MASK                    0x00000001
#define _AD1PCFGL_PCFGL0_LENGTH                  0x00000001

#define _AD1PCFGL_PCFGL1_POSITION                0x00000001
#define _AD1PCFGL_PCFGL1_MASK                    0x00000002
#define _AD1PCFGL_PCFGL1_LENGTH                  0x00000001

#define _AD1PCFGL_PCFGL2_POSITION                0x00000002
#define _AD1PCFGL_PCFGL2_MASK                    0x00000004
#define _AD1PCFGL_PCFGL2_LENGTH                  0x00000001

#define _AD1PCFGL_PCFGL3_POSITION                0x00000003
#define _AD1PCFGL_PCFGL3_MASK                    0x00000008
#define _AD1PCFGL_PCFGL3_LENGTH                  0x00000001

#define _AD1PCFGL_PCFGL4_POSITION                0x00000004
#define _AD1PCFGL_PCFGL4_MASK                    0x00000010
#define _AD1PCFGL_PCFGL4_LENGTH                  0x00000001

#define _AD1PCFGL_PCFGL5_POSITION                0x00000005
#define _AD1PCFGL_PCFGL5_MASK                    0x00000020
#define _AD1PCFGL_PCFGL5_LENGTH                  0x00000001

#define _AD1PCFGL_PCFGL6_POSITION                0x00000006
#define _AD1PCFGL_PCFGL6_MASK                    0x00000040
#define _AD1PCFGL_PCFGL6_LENGTH                  0x00000001

#define _AD1PCFGL_PCFGL7_POSITION                0x00000007
#define _AD1PCFGL_PCFGL7_MASK                    0x00000080
#define _AD1PCFGL_PCFGL7_LENGTH                  0x00000001

#define _AD1PCFGL_PCFGL8_POSITION                0x00000008
#define _AD1PCFGL_PCFGL8_MASK                    0x00000100
#define _AD1PCFGL_PCFGL8_LENGTH                  0x00000001

#define _AD1PCFGL_PCFGL9_POSITION                0x00000009
#define _AD1PCFGL_PCFGL9_MASK                    0x00000200
#define _AD1PCFGL_PCFGL9_LENGTH                  0x00000001

#define _AD1PCFGL_PCFGL10_POSITION               0x0000000A
#define _AD1PCFGL_PCFGL10_MASK                   0x00000400
#define _AD1PCFGL_PCFGL10_LENGTH                 0x00000001

#define _AD1PCFGL_PCFGL11_POSITION               0x0000000B
#define _AD1PCFGL_PCFGL11_MASK                   0x00000800
#define _AD1PCFGL_PCFGL11_LENGTH                 0x00000001

#define _AD1PCFGL_PCFGL12_POSITION               0x0000000C
#define _AD1PCFGL_PCFGL12_MASK                   0x00001000
#define _AD1PCFGL_PCFGL12_LENGTH                 0x00000001

#define _AD1PCFGL_PCFGL13_POSITION               0x0000000D
#define _AD1PCFGL_PCFGL13_MASK                   0x00002000
#define _AD1PCFGL_PCFGL13_LENGTH                 0x00000001

#define _AD1PCFGL_PCFGL14_POSITION               0x0000000E
#define _AD1PCFGL_PCFGL14_MASK                   0x00004000
#define _AD1PCFGL_PCFGL14_LENGTH                 0x00000001

#define _AD1PCFGL_PCFGL15_POSITION               0x0000000F
#define _AD1PCFGL_PCFGL15_MASK                   0x00008000
#define _AD1PCFGL_PCFGL15_LENGTH                 0x00000001

#define _AD1CSSL_CSSL0_POSITION                  0x00000000
#define _AD1CSSL_CSSL0_MASK                      0x00000001
#define _AD1CSSL_CSSL0_LENGTH                    0x00000001

#define _AD1CSSL_CSSL1_POSITION                  0x00000001
#define _AD1CSSL_CSSL1_MASK                      0x00000002
#define _AD1CSSL_CSSL1_LENGTH                    0x00000001

#define _AD1CSSL_CSSL2_POSITION                  0x00000002
#define _AD1CSSL_CSSL2_MASK                      0x00000004
#define _AD1CSSL_CSSL2_LENGTH                    0x00000001

#define _AD1CSSL_CSSL3_POSITION                  0x00000003
#define _AD1CSSL_CSSL3_MASK                      0x00000008
#define _AD1CSSL_CSSL3_LENGTH                    0x00000001

#define _AD1CSSL_CSSL4_POSITION                  0x00000004
#define _AD1CSSL_CSSL4_MASK                      0x00000010
#define _AD1CSSL_CSSL4_LENGTH                    0x00000001

#define _AD1CSSL_CSSL5_POSITION                  0x00000005
#define _AD1CSSL_CSSL5_MASK                      0x00000020
#define _AD1CSSL_CSSL5_LENGTH                    0x00000001

#define _AD1CSSL_CSSL6_POSITION                  0x00000006
#define _AD1CSSL_CSSL6_MASK                      0x00000040
#define _AD1CSSL_CSSL6_LENGTH                    0x00000001

#define _AD1CSSL_CSSL7_POSITION                  0x00000007
#define _AD1CSSL_CSSL7_MASK                      0x00000080
#define _AD1CSSL_CSSL7_LENGTH                    0x00000001

